Tekla Open API Reference for Tekla Structures 2025
DrawingItemEnumerator Properties
The DrawingItemEnumerator type exposes the following members.
Properties
Name | Description
Current
 Returns a drawing item instance of the current element.
Top
See Also
Reference
DrawingItemEnumerator Class
Tekla.Structures.Catalogs Namespace